# Dataframe

In [12]:
# DataFrame
# DataFrame is two dimensional array object with heterogeneous data. In DataFrame data is stored in the form of 
#rows and columns.
# How to create DataFrame?
# DataFrame can be created in different ways.
# 1. Series
# 2. Lists
# 3. Dictionary
# 4. Numpy array
# 5. From another dataframe
# 6. Data can read from files or database
# Syntax:
# DataFrame(data,index,columns,dtype)
# data : data is taken from various sources
# Index : row labels
# columns : columns labels
# dtype: data type of each column

In [16]:
import pandas as pd
import numpy as np
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

# Creating DataFrame using dictionary

In [27]:
# d={'Roll no':[1,2,3,4,5],'name':['ziggy','monu','mizi','lado','muma'],'class':[3,3,3,3,3],'Result':['pass','pass','pass','fail','fail']}
df=pd.DataFrame({'Roll no':[1,2,3,4,5],'name':['ziggy','monu','mizi','lado','muma'],
                 'class':[3,3,3,3,3],'Result':['pass','pass','pass','fail','fail']})
df

   Roll no   name  class Result
0        1  ziggy      3   pass
1        2   monu      3   pass
2        3   mizi      3   pass
3        4   lado      3   fail
4        5   muma      3   fail

# Create DataFrame using List

In [41]:
list1=[['ziggy',50],['monu',60],['mizi',40]]
df=pd.DataFrame(list1,columns=['name','age'])
df

    name  age
0  ziggy   50
1   monu   60
2   mizi   40

# Creating using Missing DAta

In [43]:
list1=[['ziggy',50],['monu',60],['mizi']]
df=pd.DataFrame(list1,columns=['name','age'])
df

    name   age
0  ziggy  50.0
1   monu  60.0
2   mizi   NaN

# Selecting Data

In [44]:
# 1. Row Selection
# 2. Column Selection
# Column Selection
# Selecting columns from DataFrame can be done using column header.

In [46]:
c=df['name']
d=df['age']
print(c,d)

0    ziggy
1     monu
2     mizi
Name: name, dtype: object 0    50.0
1    60.0
2     NaN
Name: age, dtype: float64

In [47]:
df=pd.DataFrame({'Roll no':[1,2,3,4,5],'name':['ziggy','monu','mizi','lado','muma'],
                 'class':[3,3,3,3,3],'Result':['pass','pass','pass','fail','fail']})
df

   Roll no   name  class Result
0        1  ziggy      3   pass
1        2   monu      3   pass
2        3   mizi      3   pass
3        4   lado      3   fail
4        5   muma      3   fail

# select Multiple columns

In [49]:
print(df[['Roll no','Result']])

   Roll no Result
0        1   pass
1        2   pass
2        3   pass
3        4   fail
4        5   fail

# Column Addition

In [56]:
df['combine1']=df['Roll no']+df['class']
df['combine2']=df['name']+df['Result']

df

   Roll no   name  class Result    combine  combine1   combine2
0        1  ziggy      3   pass  ziggypass         4  ziggypass
1        2   monu      3   pass   monupass         5   monupass
2        3   mizi      3   pass   mizipass         6   mizipass
3        4   lado      3   fail   ladofail         7   ladofail
4        5   muma      3   fail   mumafail         8   mumafail

In [57]:
# Column Deletion
# The column deletion is done using del keyword.
# It allows deleting one or more than one columns.
# The column is deleted with column name or column labels.

In [64]:
del df['combine']
df

   Roll no   name  class Result   combine2
0        1  ziggy      3   pass  ziggypass
1        2   monu      3   pass   monupass
2        3   mizi      3   pass   mizipass
3        4   lado      3   fail   ladofail
4        5   muma      3   fail   mumafail

# Row Selection, Addition and Deletion

In [65]:
# Each row is identified with index or label. We can read rows from dataframe using index or label.
# DataFrame provide two methods to perform this operation.
# 1. loc
# 2. iloc
# loc() is used to read the rows using label
# iloc() is used to read the rows using index

In [83]:
df=pd.DataFrame({'Roll no':[11,21,31,41,51],'name':['ziggy','monu','mizi','lado','muma'],
                 'class':[3,3,3,3,3],'Result':['pass','pass','pass','fail','fail']},index=[1,2,3,4,5])
df

   Roll no   name  class Result
1       11  ziggy      3   pass
2       21   monu      3   pass
3       31   mizi      3   pass
4       41   lado      3   fail
5       51   muma      3   fail

In [84]:
row=df.loc[2]
row

Roll no      21
name       monu
class         3
Result     pass
Name: 2, dtype: object

In [97]:
row=df.iloc[2]
row

Roll no      31
name       mizi
class         3
Result     pass
Name: 3, dtype: object

In [98]:
# Deletion of rows
# Deletion of rows are done using a method drop().
# It delete only one row.
# Deleting is done using row labels/index.
# It row labels are duplicated it remove multiple rows.
# head and

In [99]:
df.head(2)

   Roll no   name  class Result
1       11  ziggy      3   pass
2       21   monu      3   pass